#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.infra: Reading...
data.terraform_remote_state.infra: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.default will be created
  + resource "aws_db_instance" "default" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = "us-east-1a"
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "irango"
      + db_subnet_group_name                  = "fiap-irango-subnet-group-rds"
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "fiap-irango-rds"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.mysql5.7"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Name" = "fiap-irango-rds"
        }
      + tags_all                              = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-rds"
          + "Service"     = "fiap-irango"
        }
      + timezone                              = (known after apply)
      + username                              = "root_user"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.default will be created
  + resource "aws_db_subnet_group" "default" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "fiap-irango-subnet-group-rds"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0100135833a608e3c",
          + "subnet-06c19418469fe8f7a",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "fiap-irango-subnet-group-rds"
        }
      + tags_all                = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-subnet-group-rds"
          + "Service"     = "fiap-irango"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_elasticache_cluster.default will be created
  + resource "aws_elasticache_cluster" "default" {
      + apply_immediately          = true
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = "us-east-1a"
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "fiap-irango-cache"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = (known after apply)
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = (known after apply)
      + network_type               = (known after apply)
      + node_type                  = "cache.t3.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = (known after apply)
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + snapshot_window            = (known after apply)
      + subnet_group_name          = "fiap-irango-subnet-group-cache"
      + tags_all                   = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # aws_elasticache_subnet_group.default will be created
  + resource "aws_elasticache_subnet_group" "default" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "fiap-irango-subnet-group-cache"
      + subnet_ids  = [
          + "subnet-0100135833a608e3c",
          + "subnet-06c19418469fe8f7a",
        ]
      + tags        = {
          + "Name" = "fiap-irango-subnet-group-cache"
        }
      + tags_all    = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-subnet-group-cache"
          + "Service"     = "fiap-irango"
        }
      + vpc_id      = (known after apply)
    }

  # aws_security_group.cache will be created
  + resource "aws_security_group" "cache" {
      + arn                    = (known after apply)
      + description            = "inbound: TCP/6379 + outbound: none"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Enable communication to the Amazon ElastiCache cluster. "
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "fiap-irango-security-group-cache"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "fiap-irango-security-group-cache"
        }
      + tags_all               = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-security-group-cache"
          + "Service"     = "fiap-irango"
        }
      + vpc_id                 = "vpc-0f57070f63664a169"
    }

  # aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "inbound: TCP/3306 + outbound: none"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MYSQL/Aurora"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "fiap-irango-security-group-rds"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "fiap-irango-security-group-rds"
        }
      + tags_all               = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-security-group-rds"
          + "Service"     = "fiap-irango"
        }
      + vpc_id                 = "vpc-0f57070f63664a169"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_db_instance_endpoint         = (known after apply)
  + aws_elasticache_cluster_endpoint = (known after apply)
  + db_name                          = "irango"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>